# Pandas tutorial (Basic)

This `pandas` tutorial mainly includes two parts, **Basic** and **Advanced**. The former is mandatory for this course and the latter is optional. The following content is the **Basic**  part.

## Install Pandas
If you run code on your own computer, you need to install `pandas`. Open the console and enter ```pip install pandas```

In [1]:
# Import pandas and view pandas version. The 'as' keyword is to replace pandas with an abbreviation 'pd'.
import pandas as pd

print(pd.__version__)

1.3.0

## Introduction to pandas Data Structures
The two core data structures of `pandas` are
- `Series`
- `DataFrame`

The `Series` is designed to accommodate a sequence of one-dimensional data, and the `Dataframe` is designed to contain cases with several dimensions.

## Series
As shown below, the structure of the `Series` object is simple, which is consist of two columns data that have the same length. The **Value** column holds the data (data of any `NumPy` type) to which each element is associated with a label, contained within the **index** column, called the `index`.

|index|Value|
|:---|--:|
|0|-1|
|1|3|
|2|8|

### Defining a Series

Call the `pd.Series()` function to create a `Series` object and specify the argument `data` as a `list` or another `Series` object.

In [2]:
s = pd.Series(data = [-1,3,8]) # list
print(s)
# 'data' is the first location parameter, usually ignore parameter name
s1 = pd.Series(s) # from another Series
print(s1)

0   -1
1    3
2    8
dtype: int64
0   -1
1    3
2    8
dtype: int64

As you can see from the output of the `Series` object, on the left column there is the `index` column, which is a series of labels, and on the right are the corresponding values.

:::{note}
If you do not specify any index during the definition of the series, by default, pandas will assign numerical values increasing from 0 as labels. In this case, the labels correspond to the indexes (position in the array) of the elements in the series object.
:::

In general, it is best to create a `Series` object with meaningful labels to distinguish and identify each value. During the constructor call, the labels are added by specifying the value of the `index` option or directly specifying the argument `data` as a `dict` object.

In [3]:
s3 = pd.Series([-1, 3, 8], index=['x', 'y', 'z']) # specify the index by 'index' option
print(s3)

s2 = pd.Series({"a":-1, "b":3, "c":8}) # dictionary
print(s2)

x   -1
y    3
z    8
dtype: int64
a   -1
b    3
c    8
dtype: int64

Specify the argument `data` as a `array` object of `Numpy`.

In [4]:
import numpy as np
arr = np.array([100, 20, -3]) # from NumPy Arrays
s4 = pd.Series(arr, index=['x', 'y', 'z'] )

print(s4)

x    100
y     20
z     -3
dtype: int64

:::{note}
Always keep in mind that the values contained in the `NumPy` array or in the
original series are not copied, but are passed by reference. That is, the object is inserted
dynamically within the new series object. If it changes, for example its internal element
varies in value, then those changes will also be present in the new series object.
:::

In [5]:
arr[2] = -40
print(arr)
print(s4)

[100  20 -40]
x    100
y     20
z    -40
dtype: int64

As you can see in this example, by changing the third element of the `arr` array, we
also modified the corresponding element in the `s4` series.

 If you want to individually see the two arrays that make up this data structure, you can call the two attributes of the series as follows: index and values.

In [6]:
print(s.values)
print(s.index)

[-1  3  8]
RangeIndex(start=0, stop=3, step=1)

### Selecting the Internal Elements

You can select individual elements as ordinary `Numpy` arrays, specifying the key.

In [7]:
s2 = pd.Series({"a":-1,"b":3,"c":8})
s2[1]

3

Or you can specify the label corresponding to the position of the index.

In [8]:
s2['a']

-1

In the same way, you select multiple items in a `Numpy` array, you can specify slices as following:

In [9]:
s2[0:2]

a   -1
b    3
dtype: int64

In [10]:
s2['a':'c']

a   -1
b    3
c    8
dtype: int64

In [11]:
s2[['a','c']]

a   -1
c    8
dtype: int64

### Assigning Values to the Elements

In [12]:
s1['a'] = 100
s1

0     -1
1      3
2      8
a    100
dtype: int64

### Filtering Values

If you need to get which elements in the series are greater than 4, you
write the following

In [13]:
s = pd.Series([1, 3, 5, 2, 10])
s[s>4] # greater than 4

2     5
4    10
dtype: int64

Or you can get some elements whose position is `True` by specifying a Series filled in boolean values , you write the following

In [14]:
# According to Boolean value to filter
s = pd.Series([1, 3, 5, 2, 10])
print(s.isin([2, 5]))
print(s[s.isin([2, 5])])

0    False
1    False
2     True
3     True
4    False
dtype: bool
2    5
3    2
dtype: int64

### Operations and Mathematical Functions

The `Series` object can participate in the common mathematical operations which is the same as the `Numpy` array.

In [15]:
s*2.5

0     2.5
1     7.5
2    12.5
3     5.0
4    25.0
dtype: float64

In [16]:
np.exp(s)

0        2.718282
1       20.085537
2      148.413159
3        7.389056
4    22026.465795
dtype: float64

### Nan Value

The `NaN` refers to `Not a Number`, which generally is caused by the missing value. Before data analysis, the `NaN` value need to be adressed.

In [17]:
import numpy as np 
# Declaring a 'Series' including the NaN value
s = pd.Series([1, np.NaN, 10, 9, -2, np.NaN])
s

0     1.0
1     NaN
2    10.0
3     9.0
4    -2.0
5     NaN
dtype: float64

Call `isnull()` or `notnull()` functions to generate boolean value and further get the indexes corresponding to the `NaN` value.

In [18]:
print(s.isnull())
print(s.notnull())

0    False
1     True
2    False
3    False
4    False
5     True
dtype: bool
0     True
1    False
2     True
3     True
4     True
5    False
dtype: bool

Based on the generated boolean value, the `Series` object with full `NaN` value and without `NaN` can be generated by filtering mentioned above.

In [19]:
print(s[s.isnull()])
print(s[s.notnull()])

1   NaN
5   NaN
dtype: float64
0     1.0
2    10.0
3     9.0
4    -2.0
dtype: float64

### Operation of multiple Series

In [20]:
s = pd.Series({"Singapore":30, "Malaysia":23, "Vietnam":36, "Cambodia":41})
s1 = pd.Series({"China":51, "Japan":73, "Vietnam":36, "Laos":31})
s*s1

Cambodia        NaN
China           NaN
Japan           NaN
Laos            NaN
Malaysia        NaN
Singapore       NaN
Vietnam      1296.0
dtype: float64

As you can see, only indexes that all series have can operate.

## DataFrame

Compared with the `Series`, the `DataFrame` can contain multiple dimensional data. Its first column and first row are `index` and `columns`, respectively. (Only for DataFrame without multiple indexes, `DataFrame` with multiple indexes will be introduced in the `Advanced` part). Each column must be the same data type (numeric, string, boolean et al.) but different columns can have different data types.

|index|numeric|string|boolean|
|:--|:--:|:--:|--:|
|0|-1|Singapore|True|
|1|3|China|True|
|2|8|Japan|False|

### Defining a DataFrame

Call `DataFrame()` function to create a `DataFrame`. The `Array`, `List`, `dict` all can taken as the input of `data` argument.

In [21]:
# Array
df = pd.DataFrame(np.array([[14, 35, 35, 35],
                            [19, 34, 57, 34],
                            [42, 74, 49, 59]]))
print(df)

# List,  use 'columns' and 'index' parameters to specify the column and index of generated dataframe.
df = pd.DataFrame([["Malaysia", "Kuala Lumpur", 32365999, False],
              ["Singapore", "Singapore", 5850342, True],
              ["Vietnam", "Hanoi", 97338579, True]],
              columns = ["Country", "Capital", "Population", "Isdeveloped"],
              index=["a", "b", "c"])
print(df)

# dict
df = pd.DataFrame({"Country":["Malaysia", "Singapore", "Vietnam"],
                   "Capital":["Kuala Lumpur", "Singapore", "Hanoi"],
              "Population":[32365999, 5850342, 97338579],
              "Isdeveloped":[False, True, True]})
df

    0   1   2   3
0  14  35  35  35
1  19  34  57  34
2  42  74  49  59
     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c    Vietnam         Hanoi    97338579         True

     Country       Capital  Population  Isdeveloped
0   Malaysia  Kuala Lumpur    32365999        False
1  Singapore     Singapore     5850342         True
2    Vietnam         Hanoi    97338579         True

### Selecting the Internal Elements

Similar with `Series`, two ways can be used to select the elements from `DataFrame`. Call `iloc[]` and `loc[]` to select the elements by position and label, respectively .

In [22]:
df = pd.DataFrame([["Malaysia", "Kuala Lumpur", 32365999, False],
              ["Singapore", "Singapore", 5850342, True],
              ["Vietnam", "Hanoi", 97338579, True]],
              columns = ["Country", "Capital", "Population", "Isdeveloped"],
              index=["a", "b", "c"])
df

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c    Vietnam         Hanoi    97338579         True

In [23]:
# use ':' to represent select all
df.iloc[:,0:2]

     Country       Capital
a   Malaysia  Kuala Lumpur
b  Singapore     Singapore
c    Vietnam         Hanoi

In [24]:
df.loc[:, "Country":"Population"]

     Country       Capital  Population
a   Malaysia  Kuala Lumpur    32365999
b  Singapore     Singapore     5850342
c    Vietnam         Hanoi    97338579

In [25]:
df.loc["a", ["Country", "Population"]]

Country       Malaysia
Population    32365999
Name: a, dtype: object

In [26]:
df.iloc[[0, 1]] # If you omit number of columns, all columns will be selected

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True

Use ```columns```,```index``` and ```values``` atrributes to obtain corresponding object value.

In [27]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [28]:
df.columns

Index(['Country', 'Capital', 'Population', 'Isdeveloped'], dtype='object')

In [29]:
df.values

array([['Malaysia', 'Kuala Lumpur', 32365999, False],
       ['Singapore', 'Singapore', 5850342, True],
       ['Vietnam', 'Hanoi', 97338579, True]], dtype=object)

Select corresponding column according the label or number of columns.

In [30]:
df["Country"]

a     Malaysia
b    Singapore
c      Vietnam
Name: Country, dtype: object

In [31]:
df[["Country", "Population"]] # Use list to select multiple columns

     Country  Population
a   Malaysia    32365999
b  Singapore     5850342
c    Vietnam    97338579

In [32]:
df.Country # Also support as atrribute to select

a     Malaysia
b    Singapore
c      Vietnam
Name: Country, dtype: object

In [33]:
df["a":"b"] # When select multiple rows, do not use list

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True

In [34]:
df[0:2] # When select multiple rows, do not use list

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True

### Assigning value

In [35]:
df.loc["c", "Country"] = "Japan"
df.loc["c", "Capital"] = "Tokyo"
df.loc["c", "Population"] = 126476461
df.loc["c", "Isdeveloped"] = True
df

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c      Japan         Tokyo   126476461         True

In [36]:
df.loc["c"] = ["Japan", "Tokyo", 126476461, True]
df

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True
c      Japan         Tokyo   126476461         True

### Assigning index, columns, and name of index and columns

In [37]:
df.index = ["e", "f", "g"]
df.index.name = "label"
df.columns.name = "atributes"
df.columns = ["Coun", "Cap", "Pop", "ID"]
df

            Coun           Cap        Pop     ID
label
e       Malaysia  Kuala Lumpur   32365999  False
f      Singapore     Singapore    5850342   True
g          Japan         Tokyo  126476461   True

### Delete columns from dataframe

In [38]:
del df["ID"]
df

            Coun           Cap        Pop
label
e       Malaysia  Kuala Lumpur   32365999
f      Singapore     Singapore    5850342
g          Japan         Tokyo  126476461

### Filtering
Same as ```Series()``` mentioned above.

In [39]:
df = pd.DataFrame(np.array([[14, 35, 35, 35],
                            [19, 34, 57, 34],
                            [42, 74, 49, 59]]))
# filtering lesser than 30
df[df<30]

      0   1   2   3
0  14.0 NaN NaN NaN
1  19.0 NaN NaN NaN
2   NaN NaN NaN NaN

In [40]:
df = pd.DataFrame([["Malaysia", "Kuala Lumpur", 32365999, False],
              ["Singapore", "Singapore", 5850342, True],
              ["Vietnam", "Hanoi", 97338579, True]],
              columns = ["Country", "Capital", "Population", "Isdeveloped"],
              index=["a", "b", "c"])
# Filtering accroding to conditions of one column
df[df["Population"]<50000000]

     Country       Capital  Population  Isdeveloped
a   Malaysia  Kuala Lumpur    32365999        False
b  Singapore     Singapore     5850342         True

You can filter the `DataFrame` according to conditions of multiple columns like following:

In [41]:
df[(df["Population"] < 50000000) & (df["Isdeveloped"]==True)]

     Country    Capital  Population  Isdeveloped
b  Singapore  Singapore     5850342         True

### Transposition  of a Dataframe
Same as `Numpy` array, `Dataframe` can transpose. `Columns` changes to `Index` and `Index` changes to `Columns`.

In [42]:
df = pd.DataFrame([["Malaysia", "Kuala Lumpur", 32365999, False],
              ["Singapore", "Singapore", 5850342, True],
              ["Vietnam", "Hanoi", 97338579, True]],
              columns = ["Country", "Capital", "Population", "Isdeveloped"],
              index=["a", "b", "c"])
df1 = df.T
df1

                        a          b         c
Country          Malaysia  Singapore   Vietnam
Capital      Kuala Lumpur  Singapore     Hanoi
Population       32365999    5850342  97338579
Isdeveloped         False       True      True

In [43]:
df1.index

Index(['Country', 'Capital', 'Population', 'Isdeveloped'], dtype='object')

In [44]:
df1.columns

Index(['a', 'b', 'c'], dtype='object')

### Merge of Dataframe
Call `concat()`, `append()` functions to merge the multiple dataframes.

In [45]:
df1 = pd.DataFrame(np.random.rand(3,4))
df2 = pd.DataFrame(np.random.rand(3,4))
df3 = pd.DataFrame(np.random.rand(6,4))
df4 = pd.DataFrame(np.random.rand(3,6))

In [46]:
# Vertical merging by default.
pd.concat([df1, df2, df3, df4])

          0         1         2         3         4         5
0  0.035189  0.952455  0.832334  0.284203       NaN       NaN
1  0.273924  0.683433  0.351686  0.039677       NaN       NaN
2  0.818468  0.294889  0.017483  0.186442       NaN       NaN
0  0.782208  0.844065  0.154629  0.137631       NaN       NaN
1  0.840998  0.084557  0.370950  0.268967       NaN       NaN
2  0.662613  0.157986  0.433846  0.636929       NaN       NaN
0  0.575530  0.185950  0.196095  0.735374       NaN       NaN
1  0.421032  0.747025  0.349576  0.663201       NaN       NaN
2  0.259200  0.029259  0.233054  0.445444       NaN       NaN
3  0.886176  0.533255  0.184438  0.677293       NaN       NaN
4  0.785720  0.395151  0.405073  0.599226       NaN       NaN
5  0.410462  0.980039  0.293598  0.608530       NaN       NaN
0  0.847506  0.120076  0.286810  0.601173  0.769567  0.842559
1  0.604071  0.018982  0.845244  0.377570  0.697689  0.988924
2  0.349190  0.809465  0.277346  0.039608  0.570399  0.201759

:::{note}
As you see, when the shape of multiple dataframe don't match. blank position will be filled using `NaN` value.
:::

In [47]:
result = df1.append(df2)
result

          0         1         2         3
0  0.035189  0.952455  0.832334  0.284203
1  0.273924  0.683433  0.351686  0.039677
2  0.818468  0.294889  0.017483  0.186442
0  0.782208  0.844065  0.154629  0.137631
1  0.840998  0.084557  0.370950  0.268967
2  0.662613  0.157986  0.433846  0.636929

Horizontal merging by specifying `axis` argument as 'columns' or 1.

In [48]:
pd.concat([df1, df2, df3, df4], axis='columns')

,0,1,2,3,0,1,2,3,0,1,2,3,0,1,2,3,4,5
0,0.035189,0.952455,0.832334,0.284203,0.782208,0.844065,0.154629,0.137631,0.575530,0.185950,0.196095,0.735374,0.847506,0.120076,0.286810,0.601173,0.769567,0.842559
1,0.273924,0.683433,0.351686,0.039677,0.840998,0.084557,0.370950,0.268967,0.421032,0.747025,0.349576,0.663201,0.604071,0.018982,0.845244,0.377570,0.697689,0.988924
2,0.818468,0.294889,0.017483,0.186442,0.662613,0.157986,0.433846,0.636929,0.259200,0.029259,0.233054,0.445444,0.349190,0.809465,0.277346,0.039608,0.570399,0.201759
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.886176,0.533255,0.184438,0.677293,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.785720,0.395151,0.405073,0.599226,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.410462,0.980039,0.293598,0.608530,NaN,NaN,NaN,NaN,NaN,NaN

// todo ### `join`, `inner` and `merge`

### View data

In [49]:
df = pd.DataFrame(np.random.rand(100,4))
df.head(2)

          0         1         2         3
0  0.793051  0.604828  0.132647  0.757664
1  0.316314  0.192280  0.151864  0.277320

In [50]:
df.tail(3)

           0         1         2         3
97  0.432984  0.951242  0.248424  0.746849
98  0.366418  0.429724  0.265813  0.898179
99  0.677489  0.973459  0.620953  0.617741

### Computational tools

Compute quickly covariance and *Pearson correlation coefficients* of different columns.

In [51]:
df = pd.DataFrame(np.random.rand(5, 5), index=['i1', 'i2', 'i3', 'i4', 'i5'], 
                 columns=['c1', 'c2', 'c3', 'c4', 'c5'])
df.cov()

          c1        c2        c3        c4        c5
c1  0.048370 -0.022476  0.019211  0.071842  0.006492
c2 -0.022476  0.087275  0.015324 -0.047505 -0.001788
c3  0.019211  0.015324  0.030619  0.038420  0.004704
c4  0.071842 -0.047505  0.038420  0.122719  0.011037
c5  0.006492 -0.001788  0.004704  0.011037  0.113107

In [52]:
df.corr() # method = pearson (default), optional: kendall, spearman

          c1        c2        c3        c4        c5
c1  1.000000 -0.345921  0.499195  0.932476  0.087766
c2 -0.345921  1.000000  0.296439 -0.459028 -0.017995
c3  0.499195  0.296439  1.000000  0.626769  0.079927
c4  0.932476 -0.459028  0.626769  1.000000  0.093678
c5  0.087766 -0.017995  0.079927  0.093678  1.000000

In [53]:
df.corr(method='kendall')

     c1   c2   c3   c4   c5
c1  1.0 -0.2  0.4  0.4  0.4
c2 -0.2  1.0  0.4 -0.4  0.0
c3  0.4  0.4  1.0  0.2  0.2
c4  0.4 -0.4  0.2  1.0  0.2
c5  0.4  0.0  0.2  0.2  1.0

Compute quickly average value, maximum, mimmum and sum of different columns or rows.

In [54]:
# compute average value of each column by default.
df.mean()

c1    0.755507
c2    0.553226
c3    0.444777
c4    0.558087
c5    0.401913
dtype: float64

Compute the sum of each row by specifying the `axis` argument as 'columns' or 1.

In [55]:
df.sum(axis=1)

i1    2.196644
i2    3.991442
i3    2.084726
i4    2.465613
i5    2.829131
dtype: float64

Display a summary of the characteristics of the dataframe

In [56]:
df.describe()

             c1        c2        c3        c4        c5
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.755507  0.553226  0.444777  0.558087  0.401913
std    0.219932  0.295424  0.174984  0.350312  0.336313
min    0.493324  0.268362  0.268981  0.143859  0.041863
25%    0.541908  0.319825  0.294633  0.229888  0.135508
50%    0.868140  0.457401  0.408109  0.677977  0.328866
75%    0.921427  0.771557  0.594924  0.827979  0.721399
max    0.952737  0.948987  0.657241  0.910734  0.781928

### Data ranking

In [57]:
df = pd.DataFrame([["Malaysia", "Kuala Lumpur", 32365999, False],
              ["Singapore", "Singapore", 5850342, True],
              ["Vietnam", "Hanoi", 97338579, True],
                  ["Japan", "Tokyo", None, True]],
              columns = ["Country", "Capital", "Population", "Isdeveloped"],
              index=["a", "b", "c", "d"])
df.sort_values(by=['Population', 'Country'], ascending=False, na_position='first')

     Country       Capital  Population  Isdeveloped
d      Japan         Tokyo         NaN         True
c    Vietnam         Hanoi  97338579.0         True
a   Malaysia  Kuala Lumpur  32365999.0        False
b  Singapore     Singapore   5850342.0         True

## NaN value

In [58]:
df = pd.DataFrame(np.random.rand(5, 5), index=['i1', 'i2', 'i3', 'i4', 'i5'], 
                 columns=['c1', 'c2', 'c3', 'c4', 'c5'])
df.iloc[0,1] = np.nan
df.iloc[2,2] = np.nan
df.iloc[3,1] = np.nan
df.iloc[3,3] = np.nan
df

          c1        c2        c3        c4        c5
i1  0.054853       NaN  0.825281  0.472390  0.566194
i2  0.580852  0.564462  0.394061  0.158607  0.618355
i3  0.025236  0.166887       NaN  0.113518  0.597250
i4  0.800339       NaN  0.078607       NaN  0.725889
i5  0.085543  0.544981  0.349425  0.616216  0.179865

In [59]:
# detecting nan value
print(df.isnull())
print(df.notnull())
print(df.isna())

       c1     c2     c3     c4     c5
i1  False   True  False  False  False
i2  False  False  False  False  False
i3  False  False   True  False  False
i4  False   True  False   True  False
i5  False  False  False  False  False
      c1     c2     c3     c4    c5
i1  True  False   True   True  True
i2  True   True   True   True  True
i3  True   True  False   True  True
i4  True  False   True  False  True
i5  True   True   True   True  True
       c1     c2     c3     c4     c5
i1  False   True  False  False  False
i2  False  False  False  False  False
i3  False  False   True  False  False
i4  False   True  False   True  False
i5  False  False  False  False  False

With dataframe with full Boolean values generated above, you can easily get the number of Nan values

In [60]:
# False:0, True:1
df.isnull().sum(axis=1)

i1    1
i2    0
i3    1
i4    2
i5    0
dtype: int64

Fill `NaN` with a specific value or a value generated by some rules

In [61]:
# fill NaN value using a specific value
df.fillna(value=0)

          c1        c2        c3        c4        c5
i1  0.054853  0.000000  0.825281  0.472390  0.566194
i2  0.580852  0.564462  0.394061  0.158607  0.618355
i3  0.025236  0.166887  0.000000  0.113518  0.597250
i4  0.800339  0.000000  0.078607  0.000000  0.725889
i5  0.085543  0.544981  0.349425  0.616216  0.179865

In [62]:
# fill NaN value using a method
# set inplace to True, the changes will act on dataframe
df.fillna(method="ffill") # other method: ‘backfill’, ‘bfill’, ‘pad’
df

          c1        c2        c3        c4        c5
i1  0.054853       NaN  0.825281  0.472390  0.566194
i2  0.580852  0.564462  0.394061  0.158607  0.618355
i3  0.025236  0.166887       NaN  0.113518  0.597250
i4  0.800339       NaN  0.078607       NaN  0.725889
i5  0.085543  0.544981  0.349425  0.616216  0.179865

In [63]:
df.fillna(method="pad")

          c1        c2        c3        c4        c5
i1  0.054853       NaN  0.825281  0.472390  0.566194
i2  0.580852  0.564462  0.394061  0.158607  0.618355
i3  0.025236  0.166887  0.394061  0.113518  0.597250
i4  0.800339  0.166887  0.078607  0.113518  0.725889
i5  0.085543  0.544981  0.349425  0.616216  0.179865

In [64]:
# delete NaN value
# ‘any’ : If any NA values are present, drop that row or column.
# ‘all’ : If all values are NA, drop that row or column.

# 0, or ‘index’ : Drop rows which contain missing values.
# 1, or ‘columns’ : Drop columns which contain missing value.
df.dropna(axis="index", how="any")

          c1        c2        c3        c4        c5
i2  0.580852  0.564462  0.394061  0.158607  0.618355
i5  0.085543  0.544981  0.349425  0.616216  0.179865

## Date index

Data index is very useful for you to deal with time series. You can create a data index by the `date_range` function. The date index mentioned here usually is discrete with equal intervals and it usually has three features: begin date,  end date, and frequency (or intervals).

In [65]:
dti = pd.date_range("2018-01-01", periods=3, freq="H")
print(dti)
dti = pd.date_range(start = "2021-09-28", end="2021-09-30", freq="10H")
print(dti)

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 01:00:00',
               '2018-01-01 02:00:00'],
              dtype='datetime64[ns]', freq='H')
DatetimeIndex(['2021-09-28 00:00:00', '2021-09-28 10:00:00',
               '2021-09-28 20:00:00', '2021-09-29 06:00:00',
               '2021-09-29 16:00:00'],
              dtype='datetime64[ns]', freq='10H')

Manipulating and converting date times with timezone information

In [66]:
dti = pd.date_range(start = "2021-09-28", end="2021-09-30", freq="10H")
dti = dti.tz_localize("UTC")
dti

DatetimeIndex(['2021-09-28 00:00:00+00:00', '2021-09-28 10:00:00+00:00',
               '2021-09-28 20:00:00+00:00', '2021-09-29 06:00:00+00:00',
               '2021-09-29 16:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='10H')

In [67]:
dti = pd.date_range(start = "2021-09-28", end="2021-09-30", freq="10H")
dti = dti.tz_localize("Asia/Singapore")
dti

DatetimeIndex(['2021-09-28 00:00:00+08:00', '2021-09-28 10:00:00+08:00',
               '2021-09-28 20:00:00+08:00', '2021-09-29 06:00:00+08:00',
               '2021-09-29 16:00:00+08:00'],
              dtype='datetime64[ns, Asia/Singapore]', freq=None)

Using the `origin` option, one can specify an alternative starting point for the creation of a `DatetimeIndex`. For example, to use 1900-01-01 00:00:00 as the starting time and hour as the unit period length:

In [68]:
pd.to_datetime([100, 101, 102], unit="h", origin=pd.Timestamp("1900-01-01 00:00:00"))

DatetimeIndex(['1900-01-05 04:00:00', '1900-01-05 05:00:00',
               '1900-01-05 06:00:00'],
              dtype='datetime64[ns]', freq=None)

Supported units are: `D`:day, `h`:hour, `m`: minute, and `s`:second.

:::{tip}
The time labels of climate products is usually given a start time point and discrete time interval, and then represented by a column of integers. In this case, we can use above way to construct time labels.
:::

## Upsampling and Downsampling

* Upsampling: Increase the frequency of the samples by interpolation, such as from minutes to seconds. 
* Downsampling: Ddecrease the frequency of the samples by aggregation, such as from months to years.

In [69]:
# prepare data, this section will be introduced in the next tutorial
# Data Source: http://www.weather.gov.sg/climate-historical-daily/
data = pd.read_csv('../../assets/data/Changi_daily_rainfall.csv', index_col=0, header=0, parse_dates=True)
data.head()

            Daily Rainfall Total (mm)
Date
1981-01-01                        0.0
1981-01-02                        0.0
1981-01-03                        0.0
1981-01-04                        0.0
1981-01-05                        0.0

In [70]:
# Downsampling: Convert monthly data to yearly data by sum and max
df = data
dfsum = df.resample("Y").sum()
dfsum.head()

            Daily Rainfall Total (mm)
Date
1981-12-31                     1336.3
1982-12-31                     1581.7
1983-12-31                     1866.5
1984-12-31                     2686.7
1985-12-31                     1483.9

In [71]:
dfmax = df.resample("Y").max()
dfmax.head()

            Daily Rainfall Total (mm)
Date
1981-12-31                       71.5
1982-12-31                      109.0
1983-12-31                      181.8
1984-12-31                      154.4
1985-12-31                       86.8

In [72]:
# Upsampling: Convert monthly data to yearly data by sum and max
dfmax.resample('10D').asfreq()[0:5]

            Daily Rainfall Total (mm)
Date
1981-12-31                       71.5
1982-01-10                        NaN
1982-01-20                        NaN
1982-01-30                        NaN
1982-02-09                        NaN

In [73]:
dfmax.resample('10D').pad()[0:5]

            Daily Rainfall Total (mm)
Date
1981-12-31                       71.5
1982-01-10                       71.5
1982-01-20                       71.5
1982-01-30                       71.5
1982-02-09                       71.5

In [74]:
dfmax.resample('D').ffill(limit=2)[0:5]

            Daily Rainfall Total (mm)
Date
1981-12-31                       71.5
1982-01-01                       71.5
1982-01-02                       71.5
1982-01-03                        NaN
1982-01-04                        NaN

## Input/Output of data

Typically, you can read data from files ending in ". Xlsx" and ". CSV" using `read_excel()` and `read_csv()` functions , respectively. The `index_col` and `header` arguments are used to specify which column and row are used as `index` and `columns` of dataframe. You can also set `parse_dates` as `True` to parse `index` as the date format. If your date format is uncommon, you can specify the `date_parser` argument which is a function to use for converting a sequence of string columns to an array of datetime instances.

In [75]:
df = pd.read_csv('../../assets/data/Changi_daily_rainfall.csv', index_col=0, header=0, 
                 parse_dates=True)
df.head()

            Daily Rainfall Total (mm)
Date
1981-01-01                        0.0
1981-01-02                        0.0
1981-01-03                        0.0
1981-01-04                        0.0
1981-01-05                        0.0

In [76]:
custom_dateparse = lambda x: pd.to_datetime(x, format='%Y-%m-%d')
df = pd.read_csv('../../assets/data/Changi_daily_rainfall.csv', index_col=0, header=0, 
                 parse_dates=True, date_parser=custom_dateparse)
df.head()

            Daily Rainfall Total (mm)
Date
1981-01-01                        0.0
1981-01-02                        0.0
1981-01-03                        0.0
1981-01-04                        0.0
1981-01-05                        0.0

You can also specify the `parse_dates` argument as a `list` to parse a column as a date format.

In [77]:
df = pd.read_csv('../../assets/data/Changi_daily_rainfall.csv', index_col=0, header=0, 
                 parse_dates=[0])
df.head()

            Daily Rainfall Total (mm)
Date
1981-01-01                        0.0
1981-01-02                        0.0
1981-01-03                        0.0
1981-01-04                        0.0
1981-01-05                        0.0

The usage of `read_excel()` function is same as the `read_csv()`

:::{tip}
1. The `Series` objects can be regarded as the special `DataFrames` object. Actually, when you extract one column from the `DataFrames`, it will be converted to the `Series`.
2. The `DataFrame` object has many of the same usages as the `Numpy` array and you can learn by analogy.
:::

## References
+ [Pandas documentation](https://pandas.pydata.org/docs/).
+ [10 minutes to pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html)
+ [Python Data Analytics](https://www.apress.com/gp/book/9781484209585)